Diego Payo Martinez

In [2]:
%load_ext sql

/usr/local/lib/python3.5/dist-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/usr/local/lib/python3.5/dist-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

In [3]:
%sql sqlite:///prueba2.db

'Connected: None@prueba2.db'

In [4]:
%sql PRAGMA foreign_keys=ON;

Done.

[]

![Diagrama E/R](DER2.0.JPG)

In [4]:
%%sql 
create table ciudad (nombre varchar(20),com_auton varchar(20), primary key (nombre,com_auton));

(sqlite3.OperationalError) table ciudad already exists [SQL: 'create table ciudad (nombre varchar(20),com_auton varchar(20), primary key (nombre,com_auton));']

In [5]:
%%sql
insert into ciudad values ('Fuenlabrada','Madrid');
insert into ciudad values ('Avila','Castilla y Leon');
insert into ciudad values ('Mostoles','Madrid');
insert into ciudad values ('Valencia','Com. Valenciana');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [6]:
%sql select * from ciudad;

Done.

[(u'Fuenlabrada', u'Madrid'),
 (u'Avila', u'Castilla y Leon'),
 (u'Mostoles', u'Madrid'),
 (u'Valencia', u'Com. Valenciana')]

In [85]:
%sql create table equipo ( nombre varchar(20),primary key(nombre))

Done.

[]

In [86]:
%%sql 
insert into equipo values ('Estudiantes');
insert into equipo values ('Real Madrid CB');
insert into equipo values ('Baskonia');
insert into equipo values ('Unicaja de Malaga ');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [87]:
%sql select * from equipo;

Done.

[(u'Estudiantes',),
 (u'Real Madrid CB',),
 (u'Baskonia',),
 (u'Unicaja de Malaga ',)]

In [10]:
%%sql 
create table cancha (nombre varchar(20), dir varchar(20), primary key(nombre));

Done.

[]

In [11]:
%%sql
insert into cancha values ('cancha01','C/ Pi 3');
insert into cancha values ('cancha02','C/ La avenida 2');
insert into cancha values ('cancha03','C/ Madrid 23' );
insert into cancha values ('cancha04','C/ Real 2');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [12]:
%sql select * from cancha;

Done.

[(u'cancha01', u'C/ Pi 3'),
 (u'cancha02', u'C/ La avenida 2'),
 (u'cancha03', u'C/ Madrid 23'),
 (u'cancha04', u'C/ Real 2')]

In [18]:
%%sql
create table entrena_cancha (nom_equipo varchar(20),nom_cancha varchar(20), primary key
                     (nom_cancha), foreign key(nom_cancha) references cancha(nombre))

Done.

[]

In [19]:
%%sql
insert into entrena_cancha values('Real Madrid CB','cancha01');
insert into entrena_cancha values('Estudiantes','cancha02');
insert into entrena_cancha values('Unicaja de Malaga','cancha03');
insert into entrena_cancha values('Baskonia','cancha04');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [20]:
%sql select * from entrena_cancha;

Done.

[(u'Real Madrid CB', u'cancha01'),
 (u'Estudiantes', u'cancha02'),
 (u'Unicaja de Malaga', u'cancha03'),
 (u'Baskonia', u'cancha04')]

In [26]:
%%sql create table equipo_pertenece (nom_eq varchar(20),nom_ciu varchar(20),nom_com varchar(20), primary key(nom_ciu,nom_com), foreign key(nom_ciu,nom_com)
                                    references ciudad(nombre,com_auton));

Done.

[]

In [28]:
%%sql
insert into equipo_pertenece values ('Real Madrid CB','Fuenlabrada','Madrid');
insert into equipo_pertenece values ('Unicaja de Malaga','Avila','Castilla y Leon');
insert into equipo_pertenece values ('Estudiantes','Mostoles','Madrid');
insert into equipo_pertenece values ('Baskonia','Valencia','Com. Valenciana');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [29]:
%sql select * from equipo_pertenece;

Done.

[(u'Real Madrid CB', u'Fuenlabrada', u'Madrid'),
 (u'Unicaja de Malaga', u'Avila', u'Castilla y Leon'),
 (u'Estudiantes', u'Mostoles', u'Madrid'),
 (u'Baskonia', u'Valencia', u'Com. Valenciana')]

In [30]:
%%sql
create table campeonato(id_c int, fecha_in datetime, fecha_fin datetime, primary key (id_c));

Done.

[]

In [31]:
%%sql
insert into campeonato values (1110,"2013-07-30","2014-05-12");
insert into campeonato values (1111,"2014-07-30","2015-05-23");
insert into campeonato values (1112,"2015-07-25","2016-05-21");
insert into campeonato values (1113,"2016-06-30","2017-05-25");

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [33]:
%sql select * from campeonato;

Done.

[(1110, u'2013-07-30', u'2014-05-12'),
 (1111, u'2014-07-30', u'2015-05-23'),
 (1112, u'2015-07-25', u'2016-05-21'),
 (1113, u'2016-06-30', u'2017-05-25')]

In [34]:
%%sql
create table entrenadores ( nif varchar(20),nombre varchar(20), fecha_nac datetime, ,primary key(nif));

Done.

[]

In [37]:
%%sql

insert into entrenadores values ('1234','Edu Fernandez',"1980-9-12");
insert into entrenadores values ('12345','Mumbru ',"1977-7-2");
insert into entrenadores values ('12346','Chapu Fernandez',"1989-5-7");

1 rows affected.
1 rows affected.
1 rows affected.

[]

In [38]:
%sql select * from entrenadores;

Done.

[(u'123', u'Pablo Laso', u'1970-12-3'),
 (u'1234', u'Edu Fernandez', u'1980-9-12'),
 (u'12345', u'Mumbru ', u'1977-7-2'),
 (u'12346', u'Chapu Fernandez', u'1989-5-7')]

In [43]:
%%sql create table entrena_eq( nif_entr varchar(20), idc int , nombre_cancha varchar(20), fecha_in datetime, fecha_fin datetime, primary key(
    nif_entr,nombre_cancha), foreign key (nif_entr) references entrenadores(nif), foreign key(idc) references campeonato (id_c),
                             foreign key(nombre_cancha) references cancha(nombre))

Done.

[]

In [46]:
%%sql 

insert into entrena_eq values ('12346','1113','cancha04',"2015-11-02","2016-01-16");

1 rows affected.

[]

In [47]:
%sql select * from entrena_eq;

Done.

[(u'123', 1110, u'cancha01', u'2014-05-02', u'2015-03-12'),
 (u'1234', 1111, u'cancha02', u'2015-07-05', u'2015-09-11'),
 (u'12345', 1112, u'cancha03', u'2013-06-04', u'2015-05-16'),
 (u'12346', 1113, u'cancha04', u'2015-11-02', u'2016-01-16')]

In [48]:
%sql create table empresa_patr(nombre varchar(20), cif int, primary key(nombre));

Done.

[]

In [49]:
%%sql 
insert into empresa_patr values('Endesa',1);
insert into empresa_patr values('Iberdrola',2);
insert into empresa_patr values('Repsol',3);
insert into empresa_patr values('Nike',4);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [50]:
%sql select * from empresa_patr;

Done.

[(u'Endesa', 1), (u'Iberdrola', 2), (u'Repsol', 3), (u'Nike', 4)]

In [51]:
%%sql
create table patrocina( id_c int , nomb_camp varchar(20), primary key(id_c),foreign key(id_c) references campeonato(id_c),
                      foreign key(nomb_camp) references empresa_patr(nombre))

Done.

[]

In [52]:
%%sql
insert into patrocina values(1110,'Endesa');
insert into patrocina values(1111,'Repsol');
insert into patrocina values(1112,'Nike');
insert into patrocina values(1113,'Iberdrola');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [54]:
%sql select * from patrocina;

Done.

[(1110, u'Endesa'), (1111, u'Repsol'), (1112, u'Nike'), (1113, u'Iberdrola')]

In [55]:
%%sql
create table jugadores (nif varchar(20), nombre varchar(20), fecha_nac datetime, estatura int, primary key(nif));

Done.

[]

In [60]:
%%sql

insert into jugadores values ('12345','Mumbru ',"1977-7-2",180);
insert into jugadores values ('12346','Olesson ',"1989-5-7",183);

1 rows affected.
1 rows affected.

[]

In [61]:
%sql select * from jugadores;

Done.

[(u'123', u'LLul', u'1970-12-3', 170),
 (u'1234', u'Rudy ', u'1980-9-12', 175),
 (u'12345', u'Mumbru ', u'1977-7-2', 180),
 (u'12346', u'Olesson ', u'1989-5-7', 183)]

In [67]:
%%sql
create table jugadores_pertenece ( nif varchar(20), idc int , nombre_eq varchar(20),
                                 primary key(nif,idc,nombre_eq), foreign key(nif) references jugadores(nif),
                                 foreign key(idc) references campeonato(id_c))

Done.

[]

In [72]:
%sql insert into jugadores_pertenece values ('12346',1113,'Unicaja de Malaga');

1 rows affected.

[]

In [73]:
%sql select * from jugadores_pertenece;

Done.

[(u'123', 1110, u'Real Madrid CB'),
 (u'1234', 1111, u'Estudiantes'),
 (u'12345', 1112, u'Baskonia'),
 (u'12346', 1113, u'Unicaja de Malaga')]

In [15]:
%%sql
create table juega_contra(id_p int,idc int , equipo_casa varchar(20), equipo_fuera varchar(20),nombre_cancha varchar(20),hora_in datetime, hora_fin datetime, primary key(id_p,equipo_casa,equipo_fuera), 
                         foreign key(nombre_cancha) references cancha(nombre), foreign key(idc) references campeonato(id_c));

Done.

[]

In [14]:
%%sql
drop table juega_contra;

Done.

[]

In [16]:
%%sql

insert into juega_contra values (3,1110,'Real Madrid CB','Unicaja de Malaga',"cancha01","19:00:00","21:00:00");
insert into juega_contra values (2,1110,'Baskonia','Estudiantes',"cancha02","18:00:00","21:00:00");
insert into juega_contra values (1,1111,'Baskonia','Unicaja de Malaga',"cancha03","18:00:00","21:00:00");

1 rows affected.
1 rows affected.
1 rows affected.

[]

In [17]:
%sql select * from juega_contra

Done.

[(3, 1110, 'Real Madrid CB', 'Unicaja de Malaga', 'cancha01', '19:00:00', '21:00:00'),
 (2, 1110, 'Baskonia', 'Estudiantes', 'cancha02', '18:00:00', '21:00:00'),
 (1, 1111, 'Baskonia', 'Unicaja de Malaga', 'cancha03', '18:00:00', '21:00:00')]

In [6]:
%%sql 
create table juega_pos (idp int, nif varchar(20), pos varchar(20),tpo_banquillo int, tpo_jugando int, peso int , primary key(nif,pos,idp), 
                       foreign key(nif) references jugadores(nif))

Done.

[]

In [5]:
%%sql
drop table juega_pos;

Done.

[]

In [7]:
%%sql 
insert into juega_pos values (1,'123','base','15','34',89);
insert into juega_pos values (2,'1234','base','20','23',90);
insert into juega_pos values (3,'12345','escolta','2','39',91);
insert into juega_pos values (2,'12346','alero','15','34',76);
insert into juega_pos values (4,'123','alero','49','3',98);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [8]:
%sql select * from juega_pos;

Done.

[(1, '123', 'base', 15, 34, 89),
 (2, '1234', 'base', 20, 23, 90),
 (3, '12345', 'escolta', 2, 39, 91),
 (2, '12346', 'alero', 15, 34, 76),
 (4, '123', 'alero', 49, 3, 98)]

In [80]:
%sql create table info_partido (idp int, numcuarto int, puntuacion_casa int, puntuacion_fuera int, hora_com datetime, hora_fin datetime , primary key(idp,numcuarto,puntuacion_casa,puntuacion_fuera))

Done.

[]

In [78]:
%%sql 
drop table info_partido;

(sqlite3.OperationalError) no such table: info_partido [SQL: 'drop table info_partido;']

In [81]:
%%sql 
insert into info_partido values (1,2,67,65,"13:40","14:00");
insert into info_partido values (2,2,67,65,"13:40","14:00");
insert into info_partido values (3,4,87,65,"13:40","14:00");
insert into info_partido values (4,4,97,85,"13:40","14:00");
insert into info_partido values (2,4,107,65,"13:40","14:00");

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [82]:
%sql select * from info_partido;

Done.

[(1, 2, 67, 65, '13:40', '14:00'),
 (2, 2, 67, 65, '13:40', '14:00'),
 (3, 4, 87, 65, '13:40', '14:00'),
 (4, 4, 97, 85, '13:40', '14:00'),
 (2, 4, 107, 65, '13:40', '14:00')]

In [177]:
%%sql
create table jugadas_pos( id_jugada int ,intante_in datetime,inst_fin datetime, nombre_jugador vachar(20), primary key(id_jugada));

Done.

[]

In [178]:
%%sql
create table tiro_canasta (id_j int ,int puntuacion,primary key(id_j),foreign key (id_j) references jugadas_pos(id_jugada) on delete cascade);

Done.

[]

In [179]:
%%sql
insert into jugadas_pos values (1,"12:34","12:45","LLul");
insert into jugadas_pos values (2,"23:04","23:12","Reyes");
insert into jugadas_pos values (3,"31:12","33:34","Marc");
insert into jugadas_pos values (4,"21:34","21:45","Ayon");

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [180]:
%sql select * from jugadas_pos;

Done.

[(1, u'12:34', u'12:45', u'LLul'),
 (2, u'23:04', u'23:12', u'Reyes'),
 (3, u'31:12', u'33:34', u'Marc'),
 (4, u'21:34', u'21:45', u'Ayon')]

In [181]:
%%sql
insert into tiro_canasta values (1,3);
insert into tiro_canasta values (2,-2);
insert into tiro_canasta values (3,1);
insert into tiro_canasta values (4,2);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [182]:
%sql select * from tiro_canasta;

Done.

[(1, 3), (2, -2), (3, 1), (4, 2)]

In [191]:
%sql create table pase (id_j int ,realizacion varchar(20),primary key(id_j),foreign key (id_j) references jugadas_pos(id_jugada) on delete cascade);

(sqlite3.OperationalError) table pase already exists [SQL: u'create table pase (id_j int ,realizacion varchar(20),primary key(id_j),foreign key (id_j) references jugadas_pos(id_jugada) on delete cascade);']

In [186]:
%%sql 
insert into pase values(3,"roba Ollesson");

1 rows affected.

[]

In [188]:
%sql select * from pase;

Done.

[(1, u'fuera'), (2, u'pase a reyes'), (3, u'roba Ollesson')]

In [190]:
%sql create table robo (id_j int ,nombre varchar(20),primary key(id_j),foreign key (id_j) references jugadas_pos(id_jugada) on delete cascade);

Done.

[]

In [193]:
%%sql
insert into robo values(1,"Ferran");
insert into robo values(2,"Reyes");
insert into robo values(3,"Mirotic");
insert into robo values(4,"Guardia");

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [195]:
%sql select * from robo;

Done.

[(1, u'Ferran'), (2, u'Reyes'), (3, u'Mirotic'), (4, u'Guardia')]

In [49]:
%%sql 
create table tiene_record (nif varchar(20), id_j int , id_p int,idc int, jugada varchar(20),int numero,primary key(nif,id_j,id_p,idc),
                               foreign key(nif) references jugadores (nif), foreign key(id_j) references jugadas_pos(id_jugada)
                          foreign key(idc) references campeonato(id_c));

Done.

[]

In [48]:
%%sql 
drop table tiene_record;

Done.

[]

In [50]:
%%sql

insert into tiene_record values ('123',2,1,1111,"Rebotes",50);
insert into tiene_record values ('1234',2,1,1110,"puntuacion",90);

1 rows affected.
1 rows affected.

[]

In [51]:
%sql select * from tiene_record;

Done.

[('123', 2, 1, 1111, 'Rebotes', 50), ('1234', 2, 1, 1110, 'puntuacion', 90)]

In [208]:
%%sql
create table quitetos ( idq int, nombres varchar (50),primary key(idq) );

Done.

[]

In [210]:
%%sql
insert into quitetos values(1,"Raul-Luis-LLUl-Reyes-Guardia");
insert into quitetos values(2,"Olleson-Mirotic-Sandro-Navarro-Cabezas");
insert into quitetos values(3,"Rulli-Pirri-Kobe-Gasol-Guardia");

1 rows affected.
1 rows affected.
1 rows affected.

[]

In [211]:
%sql select * from quitetos;

Done.

[(1, u'Raul-Luis-LLUl-Reyes-Guardia'),
 (2, u'Olleson-Mirotic-Sandro-Navarro-Cabezas'),
 (3, u'Rulli-Pirri-Kobe-Gasol-Guardia')]

In [149]:
%%sql
create table quinteto_juega (idp int, idq int, pos varchar(20),tpo_banquillo int, tpo_jugando int ,idc int, primary key(idq,pos,idp), 
                       foreign key(idq) references quitetos(idq), foreign key (idc) references campeonato(id_c));

Done.

[]

In [148]:
%%sql 
drop table quinteto_juega;

Done.

[]

In [150]:
%%sql
insert into quinteto_juega values (1,1,"base","22","12",1110);
insert into quinteto_juega values (1,2,"alero","2","32",1111);

1 rows affected.
1 rows affected.

[]

In [151]:
%sql select * from quinteto_juega;

Done.

[(1, 1, 'base', 22, 12, 1110), (1, 2, 'alero', 2, 32, 1111)]

In [9]:
%%sql
create table pases_juego ( minuto datetime ,  nif varchar(20) ,  pases int ,idp int, primary key(minuto, idp), foreign key(nif) references 
                         jugadores (nif));

Done.

[]

In [10]:
%%sql
insert into pases_juego values ("12:34","123",15,1);

1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%sql select * from pases_juego;

Done.

[(u'12:34', u'123', 15, 1),
 (u'12:35', u'123', 16, 1),
 (u'22:32', u'1234', 19, 2)]

Primera Query --> juegador juega partido peso > X

In [26]:
%%sql
SELECT nombre
FROM jugadores
INNER JOIN juega_pos
WHERE jugadores.nif = juega_pos.nif and juega_pos.peso > 90

Done.

[('Mumbru ',), ('LLul',)]

Segunda query jugadores juegan pivot en un partido
No tengo jugadores insertados con pivot  puedo hacerlo con base

In [35]:
%%sql 
SELECT nombre
from jugadores
join juega_pos
WHERE pos = "base" and idp=1

Done.

[('LLul',), ('Rudy ',), ('Mumbru ',), ('Olesson ',)]

Tercera query record conseguiudo max puntuacion temporada

In [53]:
%%sql
SELECT nombre
from jugadores
join tiene_record
where jugada ="puntuacion" and tiene_record.nif = jugadores.nif

Done.

[('Rudy ',)]

Quinta query: Los 3 primeros partidos de una temporada por numero de puntos (suma de puntos de ambos equipos al terminar
el partido).

In [95]:
%%sql
SELECT 
SUM(puntuacion_casa)  +SUM(puntuacion_fuera) AS Puntuacion_3 
from info_partido
where numcuarto=4
ORDER by idp LIMIT 3

Done.

[(506,)]

Query 8: Puntuacin en un instante determinado en un partido. "baskonia" vs "Estudiantes" id partido 1

In [98]:
%%sql
SELECT puntuacion_casa || '-' || puntuacion_fuera AS Puntuacion 
from info_partido
where idp=1;

Done.

[('67-65',)]

Query 10.  Nmero de pases realizado por un jugador en un tiempo de un partido de una temporada.

In [107]:
%%sql
SELECT *
from jugadores
join pases_juego
where pases_juego.nif=jugadores.nif and idp=1

Done.

[('123', 'LLul', '1970-12-3', 170, '12:34', '123', 15, 1),
 ('123', 'LLul', '1970-12-3', 170, '12:35', '123', 16, 1)]

Query 11: Nmero de puntos conseguido por un equipo en un partido.

In [111]:
%%sql
SELECT * 
from info_partido 
where idp=2 and  numcuarto =4

Done.

[(2, 4, 107, 65, '13:40', '14:00')]

Query 13. Nmero de partidos jugados en una cancha.

In [120]:
%%sql
SELECT 
COUNT (*) AS Numero_de_partidos
from juega_contra
where juega_contra.nombre_cancha = "cancha01"

Done.

[(1,)]

Query 14: Quintetos de un equipo que jugaron en un tiempo de un partido de una temporada.

In [152]:
%%sql
Select nombres
from quitetos
join quinteto_juega
where idp=1 and idc=1110

Done.

[('Raul-Luis-LLUl-Reyes-Guardia',),
 ('Olleson-Mirotic-Sandro-Navarro-Cabezas',),
 ('Rulli-Pirri-Kobe-Gasol-Guardia',)]

Query 15: 15. Historial de los equipos entrenados por un entrenador.

In [155]:
%%sql
Select nombre_eq
join 
from entrena_eq 
(Select nif
from entrenadores
where nombre="Pablo Laso")

(sqlite3.OperationalError) near "join": syntax error [SQL: 'Select nombre_eq\njoin \nfrom entrena_eq \n(Select nif\nfrom entrenadores\nwhere nombre="Pablo Laso")']

Query 17: Cantidad de pases que un jugador hizo a otro (en un partido, tiempo, intervalo de tiempo,...).

In [168]:
%%sql
select 
SUM(pases) AS Pases
from pases_juego
where nif='123'

Done.

[(31,)]